package by.htp.entity;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

public class City {
	
	private String[] arrayCity ={"Анапа", "Алушта", "Абинск", "Аден", "Анже", "Багдат", "Балей", "Баку", "Барань", "Гродно",
			"Гомель", "Глазго", "Витебск", "Вильнюс", "Варна", "Версаль", "Воложин", "Денвер", "Джанкой ", "Душанбе", "Ереван",
			"Ельск", "Ереван", "Жодино", "Жлобин", "Ивье", "Колыма", "Лас-Вегас", "Ливерпуль", "Лион", "Львов", "Минс", "Москва",
			"Милан", "Новгород", "Омск", "Оттава", "Орша", "Пинск", "Полоцк", "Париж", "Рим", "Ростов", "Речица", "Смоленск",
			"Слоним", "Сморгонь", "Тверь", "Тула", "Торонто", "Туров", "Уфа", "Улан-Удэ", "Финикс", "Харбин", "Хотимск",
			"Хотимск", "Цинциннати", "Чернигов", "Чикаго", "Шклов", "Шанхай", "Штутгарт", "Эр-Рияд", "Элизабет", "Южно-Сахалинск",
			"Ялта", "Якутск", "Ярославль"};	
	
	private List<String> listCity = new ArrayList<String>(Arrays.asList(arrayCity));
	
	public List<String> getListCity()
	{
		return listCity;
	}
	public void setListCity(List<String> listCity)
	{
		this.listCity = listCity;
	}
}
